karrister/pic16f_wiznet/MPLAB/pic16_eth_test.X/main.c
/*reg addr end*/

typedef unsigned char BYTE;

typedef BYTE KARRI_BOOL;

typedef enum {
            IDLE,
            LISTENING,
            PEER_CONNECTED,
            REQUEST_RECEIVED,
            PARSE_REQUEST,
            SEND_RESPONSE
} mainserverSM;

/*Static */

/*static const saves it in the program memory, not RAM*/

static const BYTE get_cmd[] = "GET /index.htm";

static const BYTE website_template[] =

"HTTP/1.1 404 Not Found \
Date: Sat, 10 May 2014 08:54:23 GMT \
Server: Apache/2.2.22 (Ubuntu) \
Vary: Accept-Encoding \
Content-Length: 291 \
Content-Type: text/html; charset=iso-8859-1 \
<!DOCTYPE HTML PUBLIC \"-//IETF//DTD HTML 2.0//EN\"> \
<html><head> \
<title>404 Not Found</title> \
</head><body> \
<h1>Not Found</h1> \
<p>The requested URL /index.htm was not found on this server.</p> \
<hr> \
<address>Apache/2.2.22 (Ubuntu) Server at www.karrikivela.fi Port 80</address> \
</body></html> \
";


/*Globals*/
short g_portc = 0;


int g_rx_sock0_mask;
int g_rx_sock0_base;

int g_rx_sock1_mask;
int g_rx_sock1_base;

int g_tx_sock0_mask;
int g_tx_sock0_base;

int g_tx_sock1_mask;
int g_tx_sock1_base;

int g_mainSM_state = IDLE;

/*Macros for turning LEDs on*/
#define LED1_ON() \
  do { \
    g_portc |= 0x01; \
    PORTC = g_portc;\
  } while (0)

#define LED2_ON() \
  do { \
    g_portc |= 0x02; \
    PORTC = g_portc;\
  } while (0)

#define LED3_ON() \
  do { \
    g_portc |= 0x04; \
    PORTC = g_portc;\
  } while (0)

#define LED4_ON() \
  do { \
    g_portc |= 0x08; \
    PORTC = g_portc;\
  } while (0)

/*Macros for turning LEDs off*/
#define LED1_OFF() \
  do { \
    g_portc &= 0xFE; \
    PORTC = g_portc;\
  } while (0)

#define LED2_OFF() \
  do { \
    g_portc &= 0xFD; \
    PORTC = g_portc;\
  } while (0)

#define LED3_OFF() \
  do { \
    g_portc &= 0xFB; \
    PORTC = g_portc;\
  } while (0)

#define LED4_OFF() \
  do { \
    g_portc &= 0xF7; \
    PORTC = g_portc;\
  } while (0)

#define RESET_LOW() \
  do { \
    PORTCbits.RC4 = 0; \
  } while (0)

#define RESET_HIGH() \
  do { \
    g_portc = PORTC;\
    g_portc |= BIT4;\
    PORTC = g_portc;\
  } while (0)


/*SPI macros*/
#define CS_ASSERT() \
  do { \
    PORTCbits.RC6 = 0; \
  } while (0)

#define CS_DEASSERT() \
  do { \
    PORTCbits.RC6 = 1; \
  } while (0)


#define DELAY_BETWEEN_COMMANDS() delay(5000)

#define SPI_SYNC_TX_BYTE(tx_byte) \
    do { \
        PIR1bits.SSPIF = 0; \
        SSPBUF = tx_byte; \
        while(!PIR1bits.SSPIF); \
        PIR1bits.SSPIF = 0; \
    } while(0)


#define WIZNET_WRITE(addr, byte) \
    do { \
        CS_ASSERT();\
        SPI_SYNC_TX_BYTE(0xF0);\
        SPI_SYNC_TX_BYTE((addr & 0xFF00) >> 8);\
        SPI_SYNC_TX_BYTE(addr & 0x00FF);\
        SPI_SYNC_TX_BYTE(byte);\
        CS_DEASSERT();\
    } while(0)


/**
* This inline function reads a single byte from the chip. This function manages
* the data transfer over the SPI bus from the chip towards the master.
* @param addr The address inside the chip to read from.
* @return The byte read from the chip.
*/
inline unsigned char
wiznet_read(unsigned int addr)
{
    unsigned char rxByte = 0;
    CS_ASSERT();
    SPI_SYNC_TX_BYTE(READ_OPCODE);
    SPI_SYNC_TX_BYTE((addr & 0xFF00) >> 8);
    SPI_SYNC_TX_BYTE(addr & 0x00FF);
    SPI_SYNC_TX_BYTE(0x00); //dummy data, just for clock output
    rxByte = SSPBUF;
    CS_DEASSERT();
    return rxByte;
}


/**
* This function compares the input buffer to a command buffer and tries to find
* the specified command inside the input buffer (the offset doesn't matter).
* @param eth_buff pointer to the input buffer.
* @param cmd pointer to the command buffer.
* @param input_size the size of the data in the eth_buff input buffer
* @param cmd_size the size of the command we are looking for
* @see main()
* @return The boolean result if the specified command was found inside the input buffer.
*/
inline KARRI_BOOL compare_buffers(BYTE *eth_buff, BYTE *cmd, unsigned int input_size, unsigned int cmd_size)
{
    KARRI_BOOL ret_status = KARRI_NOK;
    int get_cmd_lookup_loop, get_cmd_matching_loop;
    for(get_cmd_lookup_loop = 0; get_cmd_lookup_loop < input_size; get_cmd_lookup_loop++)
    {
        if(eth_buff[get_cmd_lookup_loop] == cmd[0])
            for(get_cmd_matching_loop = 0; get_cmd_matching_loop < cmd_size; get_cmd_matching_loop++)
                if(eth_buff[get_cmd_lookup_loop + get_cmd_matching_loop] != cmd[get_cmd_matching_loop])
                {
                    ret_status = KARRI_NOK;
                    break;
                }
    }

    return ret_status;
}




#ifdef UART_DEBUG
inline void debug_print(DEBUG_MSG *msg)
{
    int x;
    for(x=0;x<MAX_UART_PRINT_LENGTH;x++)
    {
        if(msg[x] == '\n') //break character
        {
            break;
        }

        while(!TXSTAbits.TRMT);

        TXREG = msg[x];
    }

    while(!TXSTAbits.TRMT);
    TXREG = 0x0A;
    while(!TXSTAbits.TRMT);
    TXREG = 0x0D;

}
#else
inline void debug_print(DEBUG_MSG *msg)
{
    _nop();
}
#endif //UART_DEBUG

#if 0
/**
* This inline function makes hexa values, and prints the from the debug UART in
* the correct way. The current implementation assumes that the input
* to print are only one byte.
* @param msg the pointer to the buffer with the message to convert
* @param offset the offset into the buffer at where the value to convert is found
* @see main()
* @see debug_print()
* @return void
*/
inline void debug_print_hexa_to_string(DEBUG_MSG *msg, unsigned short offset)
{
    unsigned char  msb, lsb;
    unsigned short actual_msg_shadow_int[3];

    msb = ((msg[offset]   & 0xF0) >> 4);
    lsb = ( msg[offset+1] & 0x0F      );

    if(lsb < 0x0a)
    {
        actual_msg_shadow_int[0]  = lsb;
    }
    else
    {
        actual_msg_shadow_int[1]  = 1;
        actual_msg_shadow_int[0]  = (lsb - 10);
    }

    if(msb < 0x0a)
    {
        actual_msg_shadow_int[1] += msb;
    }
    else
    {
        actual_msg_shadow_int[2]  = 1;
        actual_msg_shadow_int[1] += (msb - 10);
    }

    msg[offset - 1] = (actual_msg_shadow_int[0] + 0x30);
    msg[offset]     = (actual_msg_shadow_int[1] + 0x30);
    msg[offset + 1] = (actual_msg_shadow_int[2] + 0x30);

    debug_print((DEBUG_MSG *)msg);
}
#endif //if 0



