karrister/pic16f_wiznet/MPLAB/pic16_eth_test.X/main.c
                DELAY_BETWEEN_COMMANDS();
                //Check if socket has been closed
                spi_rx_byte = wiznet_read(0x0403);
                if(spi_rx_byte == SOCK_CLOSED ||
                   spi_rx_byte == SOCK_CLOSE_WAIT)
                {
#ifdef KARRI_DEBUG
                    debug_print("How rude! The socket was closed by the peer!\n");
#endif
                    WIZNET_WRITE(0x0403,CLOSE);
                    //g_mainSM_state = 0xFF; //reset PIC
                    g_mainSM_state = IDLE;
                }

                break;

            case REQUEST_RECEIVED:
#ifdef KARRI_DEBUG
                debug_print("mainSM: case REQUEST_RECEIVED\n");
#endif

#define KARRI_DEBUG_RX_PATH

#ifdef KARRI_DEBUG_RX_PATH
                sprintf( int_string, "RX size: %d\n", rx_data_size );
                debug_print(int_string);
#endif

                LED3_ON();

#ifdef EXTENDED_FUNCTIONALITY

                //Get the read pointer to received data of socket 0
                spi_rx_byte = wiznet_read(0x0428);
#ifdef KARRI_DEBUG_RX_PATH
                {
                    sprintf( int_string, "spi_rx_byte MSB: %d\n", spi_rx_byte );
                    debug_print(int_string);
                }
#endif
                rx_sock1_read_pointer = (spi_rx_byte << 8);
#ifdef KARRI_DEBUG_RX_PATH
                sprintf( int_string, "RX_ptr1: %d\n", rx_sock1_read_pointer );
                debug_print(int_string);
#endif
                spi_rx_byte = wiznet_read(0x0429);
#ifdef KARRI_DEBUG_RX_PATH
                {
                    sprintf( int_string, "spi_rx_byte LSB: %d\n", spi_rx_byte );
                    debug_print(int_string);
                }
#endif
                rx_sock1_read_pointer |= spi_rx_byte;

#ifdef KARRI_DEBUG_RX_PATH
                sprintf( int_string, "RX_ptr2: %d\n", rx_sock1_read_pointer );
                debug_print(int_string);
#endif

                rx_data_offset = rx_sock1_read_pointer & g_rx_sock0_mask;
                rx_data_start_addr = g_rx_sock0_base + rx_data_offset;

                if((rx_data_size + rx_data_offset) > (g_rx_sock0_mask + 1))
                {//buffer wrap-around occured
                    unsigned int left_size = 0;
                    rx_upper_size = (g_rx_sock0_mask + 1) - rx_data_offset;

                    wiznet_read_bytes(rx_data_start_addr, eth_buff, rx_upper_size);

                    left_size = rx_data_size - rx_upper_size;

                    wiznet_read_bytes(g_rx_sock0_base, eth_buff+rx_upper_size, left_size);
                }
                else
                {
                    wiznet_read_bytes(rx_data_start_addr, eth_buff, rx_data_size);
                }
#ifdef KARRI_DEBUG_RX_PATH
                sprintf( int_string, "RX_ptr3a: %d\n", rx_sock1_read_pointer );
                debug_print(int_string);
#endif
                //Update RX buff pointer & send command for RECV done
                rx_sock1_read_pointer += rx_data_size;
                rx_sock1_read_pointer += 31;
#ifdef KARRI_DEBUG_RX_PATH
                sprintf( int_string, "RX_ptr3b: %d\n", rx_sock1_read_pointer );
                debug_print(int_string);
#endif
                WIZNET_WRITE(0x0428,((rx_sock1_read_pointer & 0xFF00) >> 8));
                WIZNET_WRITE(0x0429,( rx_sock1_read_pointer & 0x00FF)      );

                DELAY_BETWEEN_COMMANDS();

                WIZNET_WRITE(0x0403,RECV);
#endif
                g_mainSM_state = PARSE_REQUEST;
                break;

            case PARSE_REQUEST:
#ifdef KARRI_DEBUG
                debug_print("mainSM: case PARSE_REQUEST\n");
#endif
#ifdef EXTENDED_FUNCTIONALITY

#ifdef KARRI_DEBUG_RX_PATH
                debug_print(eth_buff);
#endif

                parse_status = compare_buffers(eth_buff, get_cmd, rx_data_size, sizeof(get_cmd));

                if(parse_status == KARRI_OK)
                {
                    LED4_ON();
                    g_mainSM_state = SEND_RESPONSE;
                }
                else
                {
                    LED3_OFF();
                    g_mainSM_state = PEER_CONNECTED;
                }

                { /* clear out the buffer */
                    int x;
                    for(x = ETHERNET_BUFF_SIZE; x > 0; x--)
                    {
                        eth_buff[x] = 0;
                    }
                }

#else
                g_mainSM_state = SEND_RESPONSE;
#endif


                break;

            case SEND_RESPONSE://send the web site as a response
#ifdef KARRI_DEBUG
                debug_print("mainSM: case SEND_RESPONSE\n");
#endif
#if 0 //send functionality

                //wait for TX reg size availability
                do {
                    tx_getsize_timeout_counter++;
                    delay(600);
                    //Get the size of TX socket 0
                    spi_rx_byte = wiznet_read(0x0420);
                    tx_data_size = (unsigned int)(spi_rx_byte << 8);
                    spi_rx_byte = wiznet_read(0x0421);
                    tx_data_size |= spi_rx_byte;

                    if(TX_GETSIZE_TIMEOUT_THRESHOLD < tx_getsize_timeout_counter)
                    {
                        WIZNET_WRITE(0x0403,CLOSE);
                        g_mainSM_state = IDLE;
                        break;
                    }
                } while(tx_data_size < sizeof(website_template));



                //Get the write pointer
                spi_rx_byte = wiznet_read(0x0424);
                tx_sock1_read_pointer = (unsigned int)(spi_rx_byte << 8);
                spi_rx_byte = wiznet_read(0x0425);
                tx_sock1_read_pointer |= spi_rx_byte;

                tx_data_offset = tx_sock1_read_pointer & g_rx_sock0_mask;
                tx_data_start_addr = g_rx_sock0_base + tx_data_offset;


                //wiznet_write_bytes(tx_data_start_addr, website_template, sizeof(website_template));
                //move pointer and set over SPI to CHIP
#else
                //debug_print("SEND_RESPONSE: no implementation, closing socket going back to idle\n");
                //This prepares for a reset!
                WIZNET_WRITE(0x0403,CLOSE);
                g_mainSM_state = IDLE;//0xFF; //reset PIC
#endif
                break;
                
            default:/**ENDING UP HERE CAUSES A SOFTWARE RESET!**/
#ifdef KARRI_DEBUG
                debug_print("WARNING!! Doing a soft *RESET* to PIC soon!\n");
#endif

#ifdef KARRI_DEBUG
                WIZNET_WRITE(REG_MODE,MRREG_SOFT_RESET);
#if 0
                BYTE blink_count;
                for(blink_count=0;blink_count<5;blink_count++)
                {
                    LED1_ON();
                    LED2_ON();
                    LED3_ON();
                    LED4_ON();
                    delay(5000);
                    LED1_OFF();
                    LED2_OFF();
                    LED3_OFF();
                    LED4_OFF();
                    delay(5000);//Delay for reset to happen on CHIP before PIC reset
                }
#endif
#endif //KARRI_DEBUG

                WDTCONbits.SWDTEN = 1; //Enable watchdog timer! Let it reset the damn thing!
#ifdef KARRI_DEBUG
                debug_print("Watchdog starts kicking, we shall RESET immediately!\n");
#endif
                //RESET
                break;
        }

        DELAY_BETWEEN_COMMANDS();
        DELAY_BETWEEN_COMMANDS();
    }
#endif //karri comment out the rest of the app
#ifdef KARRI_DEBUG
    //Indicate firmware finished
    LED4_ON();

    debug_print("Firmware end, looping forever\n");
    while(1);
#endif //KARRI_DEBUG

    return 0;
}

